Tekla Open API Reference for Tekla Structures 2025
CustomString Methods
The SurfaceFilterExpressions.CustomString type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
SurfaceFilterExpressions.CustomString Class
Tekla.Structures.Filtering.Categories Namespace